//public class SylasSkillStrategy implements SkillStrategy{
//
//    String PassiveDescription = "챔피언 및 스킬 레벨이 오를수록 케일의 공격이 강화됩니다.\n" +
//            "\n" +
//            "1레벨 - 영광 : 기본 공격 시 공격 속도가 5초 동안 6(+주문력의 1%)% 증가합니다.(최대 5회 중첩) 최대 중첩 시 희열 상태가 되며 이동 속도가 8% 증가합니다.\n" +
//            "\n" +
//            "6레벨 - 비상 : 공격 사거리가 525까지 늘어납니다.\n" +
//            "\n" +
//            "11레벨 - 작열 : 희열 상태 공격 시 화염파를 발사해 15/20/25/30/35(+0.25AP)(+0.1 추가AD) 마법 피해를 입힙니다.\n" +
//            "\n" +
//            "16레벨 - 승천 : 영구히 희열 상태를 유지하며 공격 사거리가 625까지 늘어납니다.";
//
//    String QDescription = "케일이 처음으로 적을 맞히면 멈추는 천상의 검을 소환합니다.\n" +
//            "\n" +
//            "검은 대상과 그 뒤에 있는 적들에게 60/100/140/180/220(+0.6 추가AD)(+0.5AP)의 마법 피해를 입히고 2초 동안 26/32/38/44/50%만큼 둔화시키며 방어력과 마법 저항력을 4초 동안 15%만큼 낮춥니다. (사정거리: 900)";
//
//    String WDescription = "케일과 대상 아군 챔피언이 60/90/120/150/180(+0.3 AP)의 체력을 회복하고 2초 동안 이동 속도가 24/28/32/36/40%(+0.08 AP) 증가합니다. (사정거리: 900)";
//
//    String EDescription = "기본 지속 효과 : 공격 시 15/20/25/30/35(+0.1 총AD)(+0.2AP)의 추가 마법 피해를 입힙니다.\n" +
//            "\n" +
//            "사용 시 : 케일의 다음 공격 사거리가 증가하며 대상이 잃은 체력의 8/9/10/11/12% (+주문력 50당 1%)만큼 추가 마법 피해를 입힙니다. 이 공격은 케일이 11레벨에 도달하면 대상에게 적중 시 폭발하여 주변 적에게 피해를 입힙니다. (사정거리: 550)";
//
//    String RDescription = " 케일이 아군 챔피언 한 명을 2초 동안 무적 상태로 만듭니다.\n" +
//            "\n" +
//            "시전 시간이 끝나면 대상 주위 지역을 정화해 주변 적에게 200/350/500(+1.0 추가AD)(+0.8AP)의 마법 피해를 입힙니다. (사정거리: 900, 범위: 500)";
//
//
//
//    @Override
//    public void Passive() {
//
//    }
//
//    @Override
//    public void Q() {
//        System.out.println("Sylas Q!");
//
//    }
//
//    @Override
//    public void W() {
//        System.out.println("Sylas W!");
//
//    }
//
//    @Override
//    public void E() {
//        System.out.println("Sylas E!");
//
//    }
//
//    @Override
//    public void R() {
//        System.out.println("Sylas R!");
//
//    }
//}
